Revit 2024 API
LoadCaseCategory Enumeration
 Specifies load case category.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Since: 2017
Syntax
C#
public enum LoadCaseCategory
Visual Basic
Public Enumeration LoadCaseCategory
Visual C++
public enum class LoadCaseCategory
Members
Member name | Description
Dead |  Dead
Live |  Live
Wind |  Wind
Snow |  Snow
RoofLive |  Roof Live
Accidental |  Accidental
Temperature |  Temperature
Seismic |  Seismic
See Also
Autodesk.Revit.DB.Structure Namespace